#include "global.h"
#include "z64rumble.h"
#include "objects/gameplay_keep/gameplay_keep.h"

extern u8 sEnvIsTimeStopped;
extern f32 sSunEnvAlpha;
extern f32 sSunColor;
extern f32 sSunScale;
extern f32 sSunPrimAlpha;
extern f32 D_801BDB90;
extern u16 D_801BDB9C;
extern u8 D_801BDBA0;
extern u8 D_801BDBA4;
extern Gfx D_0E0002C8[];
extern u8 D_801F4F30;
extern u8 D_801F4F31;
extern u8 D_801F4F32;
extern u8 D_801F4F33;
extern u8 sGameOverLightsIntensity;
extern LightInfo sNGameOverLightInfo;
extern LightInfo sSGameOverLightInfo;
extern LightNode* sNGameOverLightNode;
extern LightNode* sSGameOverLightNode;
extern Gfx* D_801F4F38;
extern s8 D_801BDBC0;
extern s8 D_801BDBC4;
extern s32 sEnvSkyboxNumStars;
extern f32 D_801F4F28;

extern s32 sSunScreenDepth;
extern s32 sSunDepthTestX;
extern s32 sSunDepthTestY;

u8 func_800FE5D0(PlayState* play);
void Environment_UpdateRain(PlayState* play);
void Environment_PlayTimeBasedSequence(PlayState* play);
void Environment_UpdateTime(PlayState* play, EnvironmentContext* envCtx, PauseContext* pauseCtx, MessageContext* msgCtx,
                            GameOverContext* gameOverCtx);
void func_800F8A9C(PlayState* play);
void func_800FEAC0(void);

void Environment_GraphCallback(GraphicsContext* gfxCtx, PlayState* play) {
    sSunScreenDepth = SysCfb_GetPixelDepth(sSunDepthTestX, sSunDepthTestY);
    Lights_GlowCheck(play);
}

typedef enum {
    /* 0x00 */ LIGHTNING_BOLT_START,
    /* 0x01 */ LIGHTNING_BOLT_WAIT,
    /* 0x02 */ LIGHTNING_BOLT_DRAW,
    /* 0xFF */ LIGHTNING_BOLT_INACTIVE = 0xFF
} LightningBoltState;

typedef struct {
    /* 0x00 */ u8 state;
    /* 0x04 */ Vec3f offset;
    /* 0x10 */ Vec3f pos;
    /* 0x1C */ s8 pitch;
    /* 0x1D */ s8 roll;
    /* 0x1E */ u8 textureIndex;
    /* 0x1F */ u8 delayTimer;
} LightningBolt; // size = 0x20

extern LightningBolt sLightningBolts[3];

typedef struct {
    /* 0x0 */ s32 mantissa;
    /* 0x4 */ s32 exponent;
} ZBufValConversionEntry; // size = 0x8

extern ZBufValConversionEntry sZBufValConversionTable[8];

#define ZBUFVAL_EXPONENT(v) (((v) >> 15) & 7)
#define ZBUFVAL_MANTISSA(v) (((v) >> 4) & 0x7FF)

/**
 * Convert an 18-bits Z buffer value to a fixed point 15.3 value
 *
 * zBufferVal is 18 bits:
 *   3: Exponent of z value
 *  11: Mantissa of z value
 *   4: dz value (unused)
 */
s32 Environment_ZBufValToFixedPoint(s32 zBufferVal) {
    // base[exp] + mantissa << shift[exp]
    s32 ret = (ZBUFVAL_MANTISSA(zBufferVal) << sZBufValConversionTable[ZBUFVAL_EXPONENT(zBufferVal)].mantissa) +
              sZBufValConversionTable[ZBUFVAL_EXPONENT(zBufferVal)].exponent;

    return ret;
}

extern s16 D_801F4F2C;
extern s8 D_801BDBBC;
extern s32 D_801F4E31;
extern s8 D_801BDBA8;

#ifdef NON_EQUIVALENT
void Environment_Init(PlayState* play, EnvironmentContext* envCtx, s32 arg2) {
    f32 temp_ft4;
    u8 var_a0;
    u8 temp_t6;
    u8 temp_t7;
    u8 temp_t8;
