#include "global.h"
#include "gfx.h"
#include "overlays/actors/ovl_En_Door/z_en_door.h"
#include "interface/parameter_static/parameter_static.h"
#include "overlays/kaleido_scope/ovl_kaleido_scope/z_kaleido_scope.h"

void MapDisp_DestroyMapI(PlayState* play);
void MapDisp_InitMapI(PlayState* play);


/*
s32 D_801BEAD0[] = {0, 1, 2, 3};




*/

extern s32 D_801BEAD0[4]; // G_IM_SIZ
extern s32 D_801BEAE0[4]; // siz_LOAD_BLOCK
extern u32 D_801BEAF0[4]; // siz_INCR
extern s32 D_801BEB00[4]; // siz_SHIFT
extern u32 D_801BEB10[4]; // siz_BYTES
extern u32 D_801BEB20[4]; // siz_LINE_BYTES
extern TexturePtr D_801BEB38;

typedef struct {
    /* 0x00 */ MinimapList* minimapList;
    /* 0x04 */ s32 curRoom;
    /* 0x08 */ s16 unk8;
    /* 0x0A */ s16 unkA;
    /* 0x0C */ s16 unkC;
    /* 0x0E */ s16 unkE;
    /* 0x10 */ TexturePtr lMapCurTex; // gameplay cur minimap room
    /* 0x14 */ s32 prevRoom;
    /* 0x18 */ TexturePtr lMapPrevTex;
    /* 0x1C */ s16 unk1C; //same as 0C
    /* 0x1E */ s16 unk1E; //same as 0E
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 swapAnimTimer;
    /* 0x28 */ void* texBuff0;
    /* 0x2C */ void* texBuff1;
    /* 0x30 */ s16 sceneMinX;
    /* 0x32 */ s16 sceneMinZ;
    /* 0x34 */ s16 sceneWidth;
    /* 0x36 */ s16 sceneHeight;
    /* 0x38 */ s16 sceneMidX;
    /* 0x3A */ s16 sceneMidZ;
    /* 0x3C */ s16* unk3C;
    /* 0x40 */ s16 unk40;
    /* 0x42 */ s16 unk42;
    /* 0x44 */ s16 unk44;
    /* 0x48 */ s16* unk48;
    /* 0x4C */ s16 unk4C;
    /* 0x50 */ s32 numChests;
    /* 0x54 */ MinimapChest* unk54;
    /* 0x58 */ s16 unk58;
    /* 0x5A */ s16 unk5A;
} MinimapContext; // size = 0x5C

extern MinimapContext sMinimapCtx;

extern s16 D_801BEBFA;         // sMinimapCtx.unk42
extern MinimapList D_801BEC14; // D_801F5130
extern s32 sSceneNumRooms;     // current scene's no. of rooms
extern s32 D_801BEC20;         // MinimapChest count
extern TransitionActorList D_801BEC24;
extern Color_RGBA8 D_801BEC2C[12]; // cat colors
extern struct_801BEC5C D_801BEC5C[5];
extern struct_801BEC70 D_801BEC70;
extern u16 D_801BEC84[0x10]; // palette 0
extern u16 D_801BECA4[0x10]; // palette 1
extern u16 D_801BECC4[0x10]; // palette 2
extern TexturePtr D_801BECE4[6];
extern TexturePtr D_801BED00[9];

typedef struct {
    /* 0x0 */ s16 sceneId;
    /* 0x4 */ s32 unk4;
    /* 0x8 */ s32 unk8;
} struct_801BED24; // size = 0xC

extern struct_801BED24 D_801BED24[2];

extern MinimapEntry D_801F5130[0x50];
extern MinimapChest D_801F5270[32];
extern TransitionActorEntry D_801F53B0[48];
extern struct_801F56B0 D_801F56B0;

extern TexturePtr D_0C000000;

void MapDisp_GetMapITexture(void* dst, s32 mapId) {
    if (MapDisp_GetSizeOfMapITex(mapId) != 0) {
        CmpDma_LoadFile(SEGMENT_ROM_START(map_i_static), mapId, dst, MapDisp_GetSizeOfMapITex(mapId));
    }
}

void func_80102E90(PlayState* play, s16* arg1) {
    *arg1 = -1;
}

void func_80102EA4(PlayState* play, s16* arg1) {
}

void func_80102EB4(u32 param_1) {
    sMinimapCtx.unk20 |= param_1;
}

void func_80102ED0(u32 param_1) {
    sMinimapCtx.unk20 &= ~param_1;
}

s32 func_80102EF0(PlayState* play) {
    MinimapEntry* entry;
    s8 curRoom;

    if (Map_IsInBossArea(play) == true) {
        return true;
    }
    curRoom = play->roomCtx.curRoom.num;
    if (curRoom == -1) {
        return false;
    }
