#include "global.h"

typedef struct {
    /* 0x0 */ s8 x;
    /* 0x1 */ s8 y;
} OcarinaControlStick; // size = 0x2

typedef struct {
    /* 0x0 */ u16 playerIO;
    /* 0x2 */ u16 channelMask;
    /* 0x4 */ u8 channelIO[3 * 33 + 1];
} NatureAmbienceDataIO; // size = 0x68

typedef struct {
    /* 0x0 */ Vec3f* pos;
    /* 0x4 */ f32 freqScale;
    /* 0x8 */ s8 reverbAdd;
} SfxSettings; // size = 0x9

typedef struct {
    /* 0x0 */ f32 vol;
    /* 0x4 */ f32 freqScale;
    /* 0x8 */ s8 reverb;
    /* 0x9 */ s8 panSigned;
    /* 0xA */ s8 stereoBits;
    /* 0xB */ u8 filter;
    /* 0xC */ u8 unk_0C;
    /* 0xD */ u8 unk_0D;
} SfxPlayerState; // size = 0xE

typedef enum {
    /* 0x0 */ SFX_CHANNEL_PLAYER0, // SfxPlayerBank
    /* 0x1 */ SFX_CHANNEL_PLAYER1,
    /* 0x2 */ SFX_CHANNEL_PLAYER2,
    /* 0x3 */ SFX_CHANNEL_ITEM0, // SfxItemBank
    /* 0x4 */ SFX_CHANNEL_ITEM1,
    /* 0x5 */ SFX_CHANNEL_ENV0, // SfxEnvironmentBank
    /* 0x6 */ SFX_CHANNEL_ENV1,
    /* 0x7 */ SFX_CHANNEL_ENV2,
    /* 0x8 */ SFX_CHANNEL_ENEMY0, // SfxEnemyBank
    /* 0x9 */ SFX_CHANNEL_ENEMY1,
    /* 0xA */ SFX_CHANNEL_ENEMY2,
    /* 0xB */ SFX_CHANNEL_SYSTEM0, // SfxSystemBank
    /* 0xC */ SFX_CHANNEL_SYSTEM1,
    /* 0xD */ SFX_CHANNEL_OCARINA, // SfxOcarinaBank
    /* 0xE */ SFX_CHANNEL_VOICE0,  // SfxVoiceBank
    /* 0xF */ SFX_CHANNEL_VOICE1
} SfxChannelIdx; // playerIdx = 2

typedef enum {
    /* 0x0 */ PLAYER_IO_PORT_0,
    /* 0x1 */ PLAYER_IO_PORT_1,
    /* 0x2 */ PLAYER_IO_PORT_2,
    /* 0x3 */ PLAYER_IO_PORT_3,
    /* 0x4 */ PLAYER_IO_PORT_4,
    /* 0x5 */ PLAYER_IO_PORT_5,
    /* 0x6 */ PLAYER_IO_PORT_6,
    /* 0x7 */ PLAYER_IO_PORT_7,
} PlayerIOPort;

typedef struct {
    /* 0x0 */ f32 value;
    /* 0x4 */ f32 target;
    /* 0x8 */ f32 step;
    /* 0xC */ s32 remainingFrames;
} FreqLerp; // size = 0x10

s32 AudioOcarina_MemoryGameGenerateNotes(void);
void Audio_StopSequenceAtPos(u8 playerIdx, u8 volumeFadeTimer);
void Audio_SetupBgmForNewDayScene(u16 seqId);
void Audio_StartBgmForScene(u16 seqId);
void Audio_PlaySeqWithPlayerIO(s8 playerIdx, u16 seqId, u8 fadeTimer, s8 arg3, u8 arg4);
void func_801A4FD8(void);
void Audio_StopSequence(s32, s32);
void Audio_StartSequence(u8 playerIdx, u8 seqId, u8 arg2, u16 fadeTimer);
s32 Audio_IsSeqCmdNotQueued(u32 arg0, u32 arg1);
void Audio_ResetSequencesAndVolume(void);
void AudioVoice_ResetData(void);
void Audio_ResetSequences(void);
void Audio_ProcessSeqCmds(void);
void Audio_SetSfxReverbIndexExceptOcarinaBank(u8 reverbIndex);
void Audio_MuteBgmPlayersForFanfare(void);
void Audio_PlayNatureAmbienceSequence(u8 natureSeqId);
s32 Audio_SetGanonsTowerBgmVolume(u8);
void Audio_StepFreqLerp(FreqLerp* lerp);
void AudioOcarina_SetCustomSequence(void);
void Audio_ProcessSfxSettings(void);
